import MakSectionTexts from "@/components/common/MakSectionTexts";

const Purpose = () => {
  return (
    <div className="flex flex-col lg:flex-row justify-between gap-0 lg:gap-30 pt-10">
      <div className="w-full lg:w-[80%]">
        <MakSectionTexts
          title="Кому підходять?"
          list={[
            "Діти 4–10 років — для гри й навчання розпізнавати емоції, дружбу, підтримку, роботу з казковими персонажами;",
            "Підлітки з 10 років — для рефлексії, роботи з реальними ситуаціями та символічними образами;",
            "Дорослі — для самопізнання, психотерапії, коучингу, роботи з клієнтами.",
          ]}
        />
        <MakSectionTexts
          title="Мета:"
          descriptionpurposeshort="Активізувати внутрішні ресурси, допомогти дитині та дорослому відчути власні сили й опору."
        />
      </div>
      <div className="w-full lg:w-[35%]">
        <MakSectionTexts
          title="Призначення:"
          descriptionpurpose="Формування впевненості, розвиток образного мислення, пошук внутрішніх ресурсів для подолання труднощів.Через візуальні образи, метафори й запитання користувач активізовує внутрішні ресурси, підсвідомі уявлення та глибинні сенси. Відновлення зв’язку із власними почуттями, тілом і досвідом."
          descriptionpurposetwo="Усвідомлення глибини емоції та внутрішніх процесів, які раніше залишалися невираженими. Знаходження слів для опису своїх переживань і надання їм конструктивного змісту, перехід до дій. Мотивація та віра у світле майбутнє"
        />
      </div>
    </div>
  );
};

export default Purpose;
