export const mockMethodics = [
  {
    category: "family",
    title: "Для роботи із сімейними парами",
    heroImage: {
      url: "../../images/CommonImages/SectionsImageFrame/FamilySection.svg",
      alt: "Сімейні пари",
    },
    cards: [
      {
        id: "1",
        title: "Емпатичне слухання в парній терапії",
        description:
          "Практика, що допомагає партнерам навчитися чути одне одного.",
        order: 1,
        slug: "empathic-listening",
      },
      {
        id: "2",
        title: "Техніка «Мости замість стін»",
        description:
          "Методика роботи зі складними образами та відновленням довіри.",
        order: 2,
      },
      {
        id: "3",
        title: "Карта емоційних тригерів",
        description:
          "Інструмент усвідомлення емоційних реакцій і пошуку гармонії.",
        order: 3,
      },
      {
        id: "4",
        title: "Емпатичне слухання в парній терапії",
        description:
          "Практика, що допомагає партнерам навчитися чути одне одного.",
        order: 4,
      },
      {
        id: "5",
        title: "Техніка «Мости замість стін»",
        description:
          "Методика роботи зі складними образами та відновленням довіри.",
        order: 5,
      },
      {
        id: "6",
        title: "Карта емоційних тригерів",
        description:
          "Інструмент усвідомлення емоційних реакцій і пошуку гармонії.",
        order: 6,
      },
      {
        id: "7",
        title: "Емпатичне слухання в парній терапії",
        description:
          "Практика, що допомагає партнерам навчитися чути одне одного.",
        order: 1,
      },
      {
        id: "8",
        title: "Техніка «Мости замість стін»",
        description:
          "Методика роботи зі складними образами та відновленням довіри.",
        order: 2,
      },
      {
        id: "9",
        title: "Карта емоційних тригерів",
        description:
          "Інструмент усвідомлення емоційних реакцій і пошуку гармонії.",
        order: 3,
      },
      {
        id: "10",
        title: "Емпатичне слухання в парній терапії",
        description:
          "Практика, що допомагає партнерам навчитися чути одне одного.",
        order: 4,
      },
      {
        id: "11",
        title: "Техніка «Мости замість стін»",
        description:
          "Методика роботи зі складними образами та відновленням довіри.",
        order: 5,
      },
      {
        id: "12",
        title: "Карта емоційних тригерів",
        description:
          "Інструмент усвідомлення емоційних реакцій і пошуку гармонії.",
        order: 6,
      },
    ],
  },
];
