import { methodic_image } from "@/public/images/MethodicsListImage";

export const mockMethodic = {
  methodic: "empathic-listening",
  title:
    "Позитивні психологічні інтервенції (Positive psychological interventions)",
  image: {
    url: methodic_image.METHODIC_IMAGE,
    alt: "Methodic illustration",
  },

  author:
    "Автор/Джерело: Seligman, M. E. P. (2002); Lyubomirsky, S. (2007); Андрейко, Б. (2016) Психотерапевтичний напрям/Підхід: Позитивна психологія. Це науковий напрям, спрямований на вивчення сильних сторін і ресурсів особистості, чинників щастя й благополуччя. Практики сприяють підвищенню оптимізму, емоційної стійкості та життєвої задоволеності.",
  age: "Підлітки та дорослі",
  goal: "Підвищити рівень щастя та благополуччя через фокус на позитивних емоціях і ресурсах.",

  purpose:
    "Використовується для покращення емоційного стану, розвитку сильних сторін особистості та досягнення мети.",

  therapeuticEffect:
    "Регулярне виконання позитивних інтервенцій сприяє підвищенню рівня задоволеності життям, формуванню оптимістичного мислення та покращенню емоційного фону.",

  shortInstruction: [
    "Запишіть список речей, які роблять вас щасливими.",
    "Щодня робіть одну річ, яка приносить радість.",
    "Фіксуйте свої відчуття після виконання.",
  ],

  instruction: [
    "Підготуйте спокійний простір для роботи без відволікань.",
    "Зробіть кілька глибоких вдихів і зосередьтесь на теперішньому моменті.",
    "Запишіть події, людей або дії, які викликають позитивні емоції.",
    "Оберіть одну дію і виконайте її усвідомлено.",
    "Після завершення зафіксуйте свої емоції.",
  ],

  reflectionQuestions: [
    "Що сьогодні принесло мені найбільше радості?",
    "Які дії позитивно впливають на мій настрій?",
    "Що заважає мені частіше зосереджуватись на позитивному?",
  ],
};
