import { text_block_image } from "@/public/images/SectionsPage/TextImageBlock";
import { text_block_mobile_image } from "@/public/images/SectionsPage/TextImageBlock/MobileBlock";
import { StaticImageData } from "next/image";

export type TextImageBlockKey =
  | "family"
  | "life"
  | "kids"
  | "communicate"
  | "pscyho"
  | "parents"
  | "uncommunicate";

export type TextImageBlockData = {
  image: StaticImageData;
  title: string;
  line1?: string;
  line2?: string;
  line3?: string;
  sub_image?: StaticImageData;
  highlight?: string;
  highlight1?: string;
  highlight2?: string;
  sub_text: string;
  mobile_image?: StaticImageData;
};

export const imageTextPresets: Record<TextImageBlockKey, TextImageBlockData> = {
  family: {
    image: text_block_image.FAMILY,
    title: "Опис розділу:",
    line1:
      "Супровід сім’ї — це розділ, спрямований на зміцнення сімейної єдності, довіри та емоційного зв’язку між членами родини. Представлені тут практики допомагають розвивати емпатію, креативність і навички уважного слухання, виявляють сильні сторони кожного та спільні ресурси родини. ",
    line2:
      "Вони підсилюють почуття приналежності, створюють атмосферу гри, радості й підтримки, сприяють появі традицій сімейних вечорів і спільних ритуалів. Цей розділ допомагає дорослим і дітям відчути себе важливими, почутими й об’єднаними у спільному просторі любові та взаєморозуміння.",
    highlight:
      "Окремі методики цього напряму підвищують рівень емпатії та взаєморозуміння між партнерами, допомагають відкрито й безпечно виражати власні потреби, сприяють конструктивному вирішенню конфліктів через творче бачення. Вони формують символ партнерства та взаємної підтримки, зміцнюючи довіру та стабільність у стосунках.",
    sub_image: text_block_image.FAMILY_SUB,
    sub_text:
      '"Стосунки — це не тільки про любов, це про здатність чути і підтримувати одне одного."',
  },
  life: {
    image: text_block_image.LIFE,
    title: "Опис розділу:",
    line1:
      "Методики цього розділу спрямовані на розвиток внутрішніх ресурсів, підвищення життєздатності та відкриття власної унікальності. Техніки базуються на принципах резильєнтності й допомагають знайти сили для подолання труднощів, відновлення енергії та гармонізації різних сфер життя.",
    line2:
      "Їхня мета — допомогти людині відновити відчуття стабільності, сили, віри у власні можливості, активізувати копінг стратегії та здатність діяти попри стрес чи кризу, використовуючи сильні сторони. Цей підхід ґрунтується на позитивній психології, арт-терапії, когнітивно-поведінковій терапії (CBT), короткостроковій розв’язально-орієнтованій терапії (BSFT), елементи символдрами та психоаналізу, психоедукація, коучинговий підхід, розвиток навички саморефлексії.",
    highlight: `До розділу входять як класичні міжнародні техніки, так і авторські практики Богдани Андрейко, що поєднують ресурсноорієнтовані, когнітивні, поведінкові й символічні підходи, що орієнтуються на унікальність людини. 
    Серед ста технік, практик, інтервенцій привідкриємо завісу до таких, як — “Шкала ресурсу”, “Позитивні психологічні інтервенції”, “Маска і Я”.`,
    highlight1:
      "Практики, які допомагають людині знайти опору в собі, побачити власні ресурси в контексті життєвих випробувань і сформувати відчуття внутрішньої стійкості,  відкриття сенсів, формування нової реальності де мрії стають цілями, а сценарій щасливого життя набуває чіткого плану дій.",
    highlight2:
      "В основі розділу — принципи BSFT (de Shazer, Berg, Insoo Kim Berg, Aaron T. Beck ,Cathy A. Malchiodi та ін), що акцентують увагу не на проблемі, а на винятках із неї та на власних силах людини. Цей підхід відображений у вправах “Добре життя”, “Мій ресурсний день”, “Список добрих подій”, “Мій день подяки”, які стимулюють клієнта помічати позитивні моменти, формувати нові сенси, цінності й розвивати психологічну гнучкість.",
    sub_text:
      '"Ти маєш силу змінити своє життя через зміни в тому, як ти думаєш і дієш."',
      mobile_image: text_block_mobile_image.LIFE_MOBILE
  },
  kids: {
    image: text_block_image.KIDS,
    title: "Опис розділу:",
    line1:
      "Розвиток творчих здібностей, креативності, психічних процесів та внутрішніх потенціалів для дітей — це розділ, спрямований на стимулювання уяви, мислення, емоційної виразності та самовираження дитини через творчу діяльність. ",
    line2:
      "Представлені тут методики допомагають розкрити індивідуальні ресурси, розвинути увагу, пам’ять, гнучкість мислення й уяву, а також підтримують емоційний інтелект і впевненість у власних здібностях.",
    line3:
      "Розвиток творчих здібностей, креативності, психічних процесів та внутрішніх потенціалів для дітей — це розділ, спрямований на стимулювання уяви, мислення, емоційної виразності та самовираження дитини через творчу діяльність. Представлені тут методики допомагають розкрити індивідуальні ресурси, розвинути увагу, пам’ять, гнучкість мислення й уяву, а також підтримують емоційний інтелект і впевненість у власних здібностях.",
    highlight:
      "Методики розділу сприяють розвитку внутрішнього потенціалу дитини, зниженню тривожності, підвищенню самооцінки, формуванню впевненості й здатності до самовираження. Через гру, малювання, історії та метафори дитина вчиться усвідомлювати власні емоції, бачити нові можливості та виявляти креативні способи розв’язання життєвих ситуацій.",
    highlight1:
      "Авторські розробки Б. Андрейко в цьому розділі орієнтовані на розвиток внутрішніх ресурсів, творчої уяви та здатності дитини до емоційного самовираження у безпечному терапевтичному просторі.",
    sub_image: text_block_image.KIDS_SUB,
    sub_text:
      '"Творчість — це ключ до розкриття всіх можливостей, що ховаються в тобі."',
  },
  communicate: {
    image: text_block_image.COMMUNICATE,
    title: "Опис розділу:",
    line1:
      "Розвиток комунікативних компетенцій та психологічного клімату — це розділ, присвячений формуванню ефективної міжособистісної взаємодії, емоційної культури та довірливих стосунків у різних соціальних і професійних контекстах, досягнення цілей та колективної мотивації до позитивного клімату.",
    line2:
      "Представлені тут методики сприяють розвитку навичок активного слухання, асертивного спілкування, емоційної регуляції та емпатії. Практики допомагають покращити взаєморозуміння між членами колективу або родини, знизити рівень напруги та створити атмосферу підтримки, прийняття й безпеки.",
    line3:
      "Розвиток комунікативних компетенцій та психологічного клімату — це розділ, присвячений формуванню ефективної міжособистісної взаємодії, емоційної культури та довірливих стосунків у різних соціальних і професійних контекстах, досягнення цілей та колективної мотивації до позитивного клімату. ",
    highlight:
      "Представлені тут методики сприяють розвитку навичок активного слухання, асертивного спілкування, емоційної регуляції та емпатії. Практики допомагають покращити взаєморозуміння між членами колективу або родини, знизити рівень напруги та створити атмосферу підтримки, прийняття й безпеки.",
    highlight1:
      "У розділі відображено принципи Positive Psychology, Brief Solution-Focused Therapy (BSFT), Emotionally Focused Therapy (EFT), Narrative Approach, Gestalt Therapy, коуч напряму, Systemic Counseling та Organizational Psychology, які підкреслюють значення автентичності, гнучкої комунікації та емоційної зрілості у створенні здорового психологічного клімату.",
    highlight2:
      "Розвиток комунікативних компетенцій та психологічного клімату — це розділ, присвячений формуванню ефективної міжособистісної взаємодії, емоційної культури та довірливих стосунків у різних соціальних і професійних контекстах, досягнення цілей та колективної мотивації до позитивного клімату. ",
    sub_text:
      '"Психічне здоровя це не ідеальність, а здатність жити у балансі, відчувати, адаптуватися до нового і знаходити сенси."',
      mobile_image: text_block_mobile_image.COMMINECATE_MOBILE
  },
  pscyho: {
    image: text_block_image.PSCYHO,
    title: "Опис розділу:",
    line1:
      "Покращення психоемоційної сфери та психічного здоров’я — це розділ, спрямований на роботу з деструктивними емоційними станами — страхом, тривожністю, панічними атаками, агресією, психотравмою, посттравматичними переживаннями (ПТСР) — у дітей та дорослих. ",
    line2:
      "Основна мета практик цього напряму полягає у відновленні внутрішньої рівноваги, зниженні інтенсивності емоційного напруження та формуванні здатності до саморегуляції й прийняття власних переживань.",
    highlight:
      "Коли страх, тривога чи панічна атака проговорюються, промальовуються та пропрацьовуються, вони втрачають свою невидиму владу, стають конкретними і керованими. Це відкриває шлях до прийняття, усвідомлення та поступового подолання. Саме через вираження, символізацію та тілесно-емоційне проживання цих станів людина повертає собі відчуття контролю, безпеки та стабільності.",
    highlight2:
      "Теоретичною базою розділу є підходи C. G. Jung (робота з архетипами й тінню), B. van der Kolk, P. Levine (психотравма та тіло), D. Siegel (нейропсихологія емоцій), J. Kabat-Zinn (майндфулнес), A. Beck (когнітивна терапія), A. Ellis (раціонально-емоційна терапія), P. Levine (соматичне відреагування), C. A. Malchiodi (арт-терапія травми), V. Frankl (екзистенційне подолання) та M. Seligman (позитивна психологія) та ін.",
    sub_text:
      '"Команда досягає успіху там, де лідер уміє слухати, підтримувати й надихати рухатися до спільної мети."',
      mobile_image: text_block_mobile_image.PSCYHO_MOBILE
  },
  parents: {
    image: text_block_image.PARENTS,
    title: "Опис розділу:",
    line1:
      "Усвідомлене батьківство — це розділ, присвячений розвитку глибокого емоційного зв’язку між батьками й дітьми, формуванню довіри, емпатії та стабільності у стосунках. ",
    line2:
      "Він об’єднує практики, створені на основі підходів казкотерапії, сімейної та сімейно-системної терапії, Brief Solution-Focused Therapy та когнітивно-поведінкової терапії (КПТ). Теоретичним підґрунтям розділу є праці J. Bowlby, D. J. Siegel & T. P. Bryson, C. A. Malchiodi, D. W. Winnicott, M. Seligman та інших дослідників, які підкреслюють важливість безпечної прив’язаності, емоційної регуляції та позитивного бачення батьківської ролі.",
    highlight:
      "У межах цього розділу подано також авторські методики Богдани Андрейко, зокрема «Батьківський Ліхтар», «Міст Довіри» (Bridge of Trust), «Сімейна казка», що допомагають батькам підтримувати довірливий зв’язок із підлітком, зберігаючи баланс між свободою та кордонами, розвивати взаємоповагу й відкриту комунікацію. ",
    highlight1:
      "Ці практики сприяють зниженню рівня конфліктності в сім’ї, підвищують відчуття безпеки й довіри у дитини, розвивають емоційний інтелект і впевненість у собі. ",
    highlight2:
      "Вони допомагають формувати теплі, стабільні та довірливі стосунки між батьками й дітьми, підтримують родину у період сепарації, сприяють формуванню відповідальності та автономії підлітків, допомагають долати кризові етапи розвитку й зберігати любов як основу сімейної єдності.",
    sub_text:
      '"Усвідомлене батьківство — це не тільки про те, щоб виховувати дитину, а й про те, щоб бути прикладом гармонії та взаєморозуміння."',
      mobile_image: text_block_mobile_image.PARENTS_MOBILE
  },
  uncommunicate: {
    image: text_block_image.UNCOMMUNICATE,
    title: "Опис розділу:",
    line1:
      "Комунікативні компетенції дітей з порушенням мовлення — це розділ, присвячений розвитку вербальної та невербальної взаємодії у дітей із різними мовленнєвими порушеннями.",
    line2:
      "Основна мета цього напряму — формування ефективних способів спілкування, розширення мовленнєвого досвіду та підтримка емоційного контакту дитини з оточенням. Представлені методики спрямовані на стимулювання мовлення, розвиток артикуляції, фонематичного слуху, розуміння мови та комунікативної ініціативи.",
    line3:
      "Авторські методики Б. Андрейко, представлені у цьому розділі, спрямовані на формування цілісного комунікативного простору, у якому дитина вчиться виражати себе словами, рухами, образами та емоціями, відновлюючи зв’язок між внутрішнім світом і зовнішнім спілкуванням.",
    highlight:
      "Практики розділу поєднують елементи логопсихології, нейропсихології, ігрової терапії, арт-терапії, наративного підходу, позитивної психології, Brief Solution-Focused Therapy (BSFT) та когнітивно-поведінкової терапії (КПТ). Вони спрямовані не лише на корекцію мовлення, а й на розвиток упевненості, самовираження, здатності до соціальної взаємодії й емоційного саморегулювання.",
    highlight2:
      "Теоретичне підґрунтя розділу становлять праці L. S. Vygotsky (соціокультурна теорія розвитку мовлення), A. R. Luria (нейропсихологічна організація мовлення), C. Malchiodi (терапевтичне мистецтво як спосіб комунікації), H. Gardner (множинний інтелект і вербально-лінгвістичний розвиток), J. Bruner (мовлення як інструмент когнітивного становлення) та B. van der Kolk (емоційно-тілесні аспекти комунікації).",
    sub_text:
      '"Спілкування — це не лише обмін словами, це мистецтво взаєморозуміння."',
      mobile_image: text_block_mobile_image.UNCOMMUNICATE_MOBILE
  },
};
