export const section_slides = [
    {
      leftTitle: "ІНТЕРАКТИВНІ ЗАВДАННЯ",
      leftText:
        "Інтерактивні завдання та ігри допомагають розвивати навички через гру, адже вони поєднують навчання з елементами розваги. Учасник отримує можливість тренувати логіку, увагу та креативність у невимушеній формі, що підвищує мотивацію та робить процес засвоєння знань більш ефективним.",
      rightTitle: "ВПРАВИ ТА ТЕХНІКИ",
      rightText:
        "Вправи та техніки практики спрямовані на розвиток і вдосконалення навичок, оскільки вони формують послідовність дій, допомагають закріпити отримані знання, тренують увагу та концентрацію, а також створюють умови для поступового переходу від простих до складних завдань.",
    },
    {
      leftTitle: "АВТОРСЬКІ МЕТОДИТИ",
      leftText:
        "Авторські методики створені на основі багаторічного досвіду та досліджень, що робить їх практичними й ефективними. Вони допомагають засвоювати знання у зрозумілій формі, поєднуючи перевірені підходи з реальними прикладами. Такий формат сприяє кращому результату та дозволяє легко застосовувати отримані навички в житті.",
      rightTitle: "РОБОТА З ЕМОЦІЯМИ",
      rightText:
        "Робота з емоціями допомагає досягти внутрішнього балансу та гармонії. Вона вчить усвідомлювати власні переживання, керувати ними та трансформувати негативні стани у ресурсні. Такий підхід знижує рівень стресу, підвищує емоційну стійкість і створює відчуття цілісності та спокою у повсякденному житті.",
    },
    {
      leftTitle: "РОЗВИТОК КОМУНІКАЦІЇ",
      leftText:
        "Розвиток комунікації сприяє досягненню гармонії в стосунках. Він допомагає краще розуміти себе й інших, навчатися слухати та висловлювати власні думки відкрито й без конфліктів. Такий підхід зміцнює довіру, формує взаємоповагу та створює міцний фундамент для здорових і щирих взаємин.",
      rightTitle: "СЕРТИФІКАТ",
      rightText:
        "Сертифікат із номером зараховується як стажування та підтверджує вашу кваліфікацію. Він є офіційним підтвердженням набутого досвіду та знань, підвищує вашу конкурентоспроможність і відкриває більше професійних можливостей. Такий документ додає ваги у резюме та демонструє роботодавцю вашу готовність до практичної роботи.",
    },
  ];
  