export const TextSwiperSliders = {
     slides :[
        {
          title: "ДЛЯ СЕБЕ",
          description:
            "Якщо ви відчуваєте втрату ресурсу, життєздатності, мотивації, втому, стрес та тривогу. Пізнання себе, відкриття самоцінності, унікальності і знаходження сенсу. Досягнення цілей через призму власних ресурсів.",
        },
        {
          title: "ДЛЯ СІМЕЙНИХ ПАР",
          description:
            "Втрата психоемоційного зв’язку, близькості та сумісності, відсутність взаєморозуміння, поваги один до одного. Щоб відновити гармонію, зменшити конфлікти та стати ближчими.",
        },
        {
          title: "ДЛЯ ДІТЕЙ І ПІДЛІТКІВ",
          description:
            "Відсутність відчуття унікальності, мотивації, дисципліни та системності, хронічна втома, стрес тривога, нерозуміння сенсів та цінностей, страх майбутнього. Розвиток комунікації, самооцінки, емпатії та творчих здібностей.",
        },
        {
          title: "ДЛЯ БАТЬКІВ І ДІТЕЙ",
          description:
            "Втрата емоційного зв’язку та спілкування з дитиною, проблеми з сепарацією, ненормована та неконтрольована поведінка дітей та підлітків. Усвідомлене виховання, покращення дитячо-батьківських стосунків та гармонійного співіснування в сім’ї.",
        },
        {
          title: "ДЛЯ ОСВІТНЬОГО СЕРЕДОВИЩА",
          description:
            "Відсутність комунікації в колективі, субардинації, емпатії, взаєморозуміння та поваги, неконструктивне спілкування, мобінг і булінг. Покращення психологічного клімату, комунікації та продуктивності.",
        },
        {
          title: "ДЛЯ РОБОТИ З ТРАВМОЮ",
          description:
            "Ознаки ПТСР, емоційна відстороненність, проблеми зі сном, дратівливість, флешбеки, проблеми у стосунках, нездатність довіряти, ізоляція, емоційна нестабільність, часті спалахи гніву, смутку, паніки, втрата унікальності. Покращення стану при страху, панічних атаках, ПТСР, агресії.",
        },
      ]
    }