export const TermsOfuseData = [
    {
      title: "Загальні положення",
      description:
        "Ці Умови користування регулюють доступ та використання сайту РОК-М і всіх матеріалів, що на ньому розміщені.",
      extra:
        "Використовуючи наш сайт, ви підтверджуєте свою згоду з цими Умовами. Якщо ви не згодні з ними — будь ласка, не використовуйте сайт.",
    },
    {
      title: "Послуги сайту",
      list: [
        "Доступ до психологічних методик, вправ, ігор та тренінгів.",
        "Онлайн-матеріали (тексти, відео, аудіо, PDF).",
        "Сертифікати після завершення програм.",
        "Інформаційна підтримка користувачів.",
      ],
    },
    {
      title: "Використання матеріалів",
      list: [
        "Усі методики та тренінги призначені для особистого використання.",
        "Заборонено поширювати матеріали третім особам без письмової згоди адміністрації.",
        "Матеріали не можна продавати, копіювати чи публікувати в публічному доступі.",
      ],
    },
    {
      title: "Оплата та доступ",
      list: [
        "Оплата здійснюється онлайн через захищені платіжні системи.",
        "Доступ відкривається після підтвердження платежу.",
        "У разі технічних проблем доступ може бути відновлений вручну.",
        "Умови повернення коштів визначаються політикою адміністрації (наприклад, якщо доступ не був активований).",
      ],
    },
    {
      title: "Обмеження відповідальності",
      list: [
        "Методики та тренінги не замінюють особисту психотерапію чи медичне лікування.",
        "Використання матеріалів здійснюється на власний ризик користувача.",
        "Адміністрація не несе відповідальності за індивідуальні результати практики.",
      ]
    },
    {
      title: "Зміни в умовах",
      description: "Адміністрація залишає за собою право вносити зміни до цих Умов у будь-який час.",
      extra:"Оновлена редакція набуває чинності з моменту публікації на сайті."
    },
    {
      title: "Контакти",
      description:
        "З усіх питань щодо обробки персональних даних ви можете звернутися:",
    },
  ];
  