export type PrivacyPolicySection = {
  heading: string;
  paragraphs?: string[];
  list?: string[];
};

export const PravicyData: PrivacyPolicySection[] = [];

export const copyrightData: PrivacyPolicySection[] = [
  {
    heading: "1. Загальні положення",
    paragraphs: [
      "1.1. Виконавець (фізична особа-підприємець Андрейко Богдана Володимирівна) розробив та прийняв умови цієї Політики конфіденційності (далі по тексту - Політики) щодо веб-сайту https://www.rok-mentalhealth.com, усвідомлюючи відповідальність перед своїми користувачами за збереження їхніх персональних даних, поважаючи фундаментальне право на захист персональних даних, усвідомлюючи цивільну відповідальність, що покладена на Виконавця відповідно до законодавства про захист персональних даних та інших законодавчих актів, спрямованих на захист персональних даних; поважаючи Європейський Регламент General Data Protection Regulation (далі - GDPR), Regulation EU № 2016/679, який визначає персональні дані як будь-яку інформацію, що стосується фізичної особи, яку ідентифіковано чи може бути ідентифіковано.",
      "1.2. Термін «Персональні дані» означає будь-яку інформацію, що стосується фізичної особи, яку ідентифіковано чи можна ідентифікувати («суб'єкт даних»); фізична особа, яку можна ідентифікувати, є такою особою, яку можна ідентифікувати, прямо чи опосередковано, зокрема, за такими ідентифікаторами як ім'я, ідентифікаційний номер, дані про місцеперебування (локацію), зображення особи на фотографії (фотографічних творах) чи іншим чином або за одним чи декількома факторами, що є визначальними для фізичної, фізіологічної, генетичної, розумової, економічної, культурної чи соціальної сутності такої фізичної особи.",
    ],
  },
  {
    heading: "2. Згода на обробку персональних даних",
    paragraphs: [
      "2.1. Користувач, приймаючі Умови Публічної оферти про надання доступу до цифрового інформаційно-методичного продукту (https://www.rok-mentalhealth.com) щодо користування веб-сайтом (https://www.rok-mentalhealth.com), та умови цієї Політики конфіденційності, надає свою згоду відповідно до законодавства про захист персональних даних та Регламенту GDPR на обробку Виконавцем (фізична особа-підприємець Андрейко Богдана Володимирівна) його/її персональних даних і підтверджує, що, даючи таку згоду, він діє по своїй волі і в своїх інтересах. Згода поширюється на наступну інформацію, яка може бути надана Користувачем Виконавцю: ім'я, прізвище, по-батькові, дату народження, стать, дані пристрою, електронну адресу (або інші засоби зв'язку), IP-адресу; параметри і настройки інтернет-браузерів, інша надана Користувачем інформація.",
    ],
  },
  {
    heading: "3. Мета збору, обробки, зберігання персональних даних",
    paragraphs: [
      "3.1. Згода на обробку персональних даних надається Користувачем з метою виконання умов цієї Політики для здійснення будь-яких дій стосовно персональних даних, включаючи, але не обмежуючись: збір, систематизацію, накопичення, зберігання, адаптування, уточнення (оновлення, зміну), використання, поширення (в тому числі шляхом реалізації або передачі), транскордонної передачі, знеособлення, блокування, знищення, а також здійснення будь-яких інших дій з персональними даними відповідно до чинного законодавства.",
      "3.2. Обробка персональних даних здійснюється Виконавцем з використанням засобів автоматизації. При обробці персональних даних Виконавець не обмежений в застосуванні способів їх обробки.",
    ],
  },
  {
    heading: "4. Доступність даних третім особам",
    paragraphs: [
      "4.1. Персональні дані, надані Користувачем, будуть доступні співробітникам Виконавця. Виконавець не продає та не розголошує персональні дані Користувачів третім особам, за винятком випадків, передбачених цією Політикою або законом, Регламентом GDPR. Зокрема, Виконавець може використовувати послуги третіх осіб для обробки персональних даних Користувача. Дана обробка здійснюється з різними цілями, наприклад, для надання основних та додаткових послуг користувачеві, для розсилки інформаційних матеріалів тощо. Незалежні постачальники послуг погоджуються обов'язково дотримуватися конфіденційності і не мають права використовувати персональні дані Користувача для інших цілей. Виконавець також передає персональні дані Користувача в правоохоронні, судові, податкові, фіскальні та інші компетентні органи в тому обсязі, в якому цього вимагає чинне законодавство, Регламент GDPR, або, якщо це є необхідним для запобігання, виявлення або припинення злочинних дій і шахрайства, а також для захисту прав Виконавця, Користувача або третіх осіб.",
      "4.2. Виконавець забезпечує належну безпеку персональних даних Користувача, у тому числі, захист проти несанкціонованого чи незаконного опрацювання та проти ненавмисної втрати, знищення чи завдання шкоди, із застосуванням відповідних технічних і організаційних інструментів.",
    ],
  },
  {
    heading: "5. Строк дії Політики",
    paragraphs: [
      "5.1. Ця Політика діє протягом невизначеного терміну і поширює свою дію на всіх Користувачів, починаючи з моменту початку надання їм послуг на веб-сайті.",
      "5.2. Дозвіл Користувача на обробку персональних даних діє протягом усього строку дії цієї Політики, протягом часу надання послуг Користувачеві відповідно до Умов та Положень щодо користування послугами на веб-сайті https://www.rok-mentalhealth.com та після надання цих послуг. Погоджуючись на умови цієї Політики, Користувач підтверджує, що обсяг прав Виконавця як суб'єкта персональних даних відповідно до законодавства про захист персональних даних, Регламенту GDPR йому відомий та зрозумілий.",
    ],
  },
  {
    heading:
      "6. Застосування законодавства про захист персональних даних та Регламенту GDPR (Regulation EU № 2016/679)",
    paragraphs: [
      "6.1. Ця Політика конфіденційності розроблена у відповідності до вимог законодавства України про захист персональних даних та згідно Регламенту GDPR / Regulation EU № 2016/679 щодо обробки і переміщення персональних даних, які використовуються для цілей ефективного використання веб-сайту https://www.rok-mentalhealth.com, та надаються з його допомогою з урахування ключових принципів GDPR. У випадках, якщо відносини сторін не врегульовані цією Політикою, застосовуються положення законодавства України про захист персональних даних та/або Регламенту GDPR.",
    ],
  },
  {
    heading:
      "7. Види персональних даних, які можуть бути зібрані, збережені та використані",
    list: [
      "7.1. Інформація про комп'ютер та інший пристрій Користувача, включаючи IP-адресу, географічне положення, тип і версію браузера та операційну систему;",
      "7.2. Інформація про відвідування та використання веб-сайту, включаючи джерело рефералів, тривалість відвідування, перегляди сторінок та шляхи навігації;",
      "7.3. Інформація, яку Користувач вводить під час введення даних для отримання послуг на веб-сайті: ім'я, стать, дата народження, електронна пошта, номер телефону, інші дані, які можуть вимагатися Виконавцем для початку надання послуг;",
      "7.4. Інформація, яка генерується під час використання веб-сайту, в тому числі, коли, як часто та за яких умов Користувач користується веб-сайтом;",
      "7.5. Інформація, що стосується усіх сервісів веб-сайту, які Користувач використовує, а також інформація про транзакції (у разі їх здійснення Користувачем через веб-сайт), оплачуючи надані послуги, включаючи платіжні дані Користувача;",
      "7.6. Будь-які інші персональні дані, які Користувач надає Виконавцю при використанні веб-сайту.",
    ],
    paragraphs: [
      "Вказана інформація може бути надана Користувачем через веб-сайт https://www.rok-mentalhealth.com, інші веб-ресурси Виконавця або пов'язаних з ним осіб, через способи електронної комунікації (електронна пошта, месенджери тощо), на живо (оф-лайн).",
    ],
  },
  {
    heading: "8. Використання персональних даних",
    paragraphs: [
      "8.1. Використання персональних даних, наданих Користувачем Виконавецю через веб-сайт, використовується з метою:",
      "8.2. Користувач може в будь-який час припинити користування послугами веб-сайту та вимагати видалення своїх персональних даних (у тому числі фотографій, фотографічних творів, наданих Користувачем). Відкликання згоди Користувачем не впливає на законність опрацювання персональних даних, що грунтувалося на згоді Користувача до її відкликання.",
    ],
    list: [
      "адміністрування веб-сайту;",
      "популяризації ФОП Андрейко Б.В., її контенту, її брендів та комерційних позначень (у тому числі, але не виключно - «РОК МАК be unique «Ресурс SenseDia», «РОК-М РЕСУРСНО-ОРІЄНТОВАНІ КОГНІТИВНІ МЕТОДИКИ»);",
      "персоналізація надання послуг Користувачам;",
      "надання доступу Користувачам до сервісів, доступних при використанні веб-сайту;",
      "надсилання інформації Користувачам про оплату за користування платними сервісами веб-сайту;",
      "надсилання Користувачам маркетингових комерційних повідомлень;",
      "надсилання Користувачам електронних інформаційних повідомлень, якщо Користувач підписався на них (Користувач може скасувати підписку в будь-який час);",
      "відправлення Користувачам маркетингових комунікацій, пов'язаних з веб-сайтом або бізнесом третіх осіб, які, на думку Виконавця, можуть зацікавити Користувача;",
      "надання третім особам (фахівці, залучені Виконавцем для надання послуг Користувачеві) інформації, наданої Користувачем, для надання послуг на веб-сайті;",
      "робота з запитами та скаргами, які надіслані Користувачем стосовно роботи веб-сайту;",
      "забезпечення безпеки веб-сайту та запобігання шахрайству;",
      "захисту прав Виконавця, Користувача.",
    ],
  },
  {
    heading: "9. Міжнародна передача даних",
    paragraphs: [
      "9.1. Інформація, яку Виконавець збирає, може зберігатися, оброблятися та передаватися між будь-якою з країн, в тому числі країни Європейського економічного простору (ЄС), та ті, в яких працює Виконавець, з тим щоб дозволити використовувати інформацію відповідно до цієї політики.",
      "9.2. Інформація, яку Виконавець збирає, може бути передана до таких країн, які мають належний рівень захисту персональних даних, еквівалентний тому, що діє в Європейському економічному просторі (ЄС) та США. США, держави - учасниці Європейського економічного простору, а також держави, які підписали Конвенцію Ради Європи про захист осіб у зв'язку з автоматизованою обробкою персональних даних, визнаються такими, що забезпечують належний рівень захисту персональних даних.",
      "9.3. Користувач цим надає поінформоване погодження на передачу та оброблення Виконавцем персональних даних Користувача відповідно до мети використання цих даних, яка вказана у цій Політиці.",
    ],
  },
  {
    heading: "10. Збереження персональних даних",
    paragraphs: [
      "10.1. Виконавець зобов'язаний дотримувався юридичних зобов'язань стосовно збереження та видалення персональних даних.",
      "10.2. Персональні дані, які Виконавець обробляє для будь-яких цілей, які передбачені цією Політикою, можуть зберігатися і після надання послуг Користувачу на веб-сайті.",
      "10.3. Дані Користувача повинні негайно видалятися на вимогу Користувача, яка надіслана у електронному повідомленні адміністратору веб-сайту.",
      "10.4. Незважаючи на положення цього розділу щодо видалення персональних даних, Виконавець зберігатиме окремі відомості, що містять персональні дані:",
    ],
    list: [
      "10.4.1. в тій мірі, в якій Виконавець повинен це робити у відповідності до законодавства про захист персональних даних та Регламенту GDPR;",
      "10.4.2. якщо Виконавець вважає, що ці відомості можуть мати відношення до будь-якого поточного або майбутнього судового розгляду або кримінального провадження;",
      "10.4.3. для встановлення, здійснення або захисту юридичних прав Виконавця (у тому числі надання іншої інформації для запобігання шахрайству та зменшення фінансового ризику).",
    ],
  },
  {
    heading: "11. Безпека персональних даних Користувача",
    paragraphs: [
      "11.1. Виконавець буде приймати обгрунтовані технічні та організаційні запобіжні заходи, щоб запобігти втраті, неправильному використанню або зміні персональних даних Користувача.",
      "11.2. Виконавець зберігатиме всі персональні дані Користувача на безпечних (захищених паролем і захищених брандмауером) серверах Виконавця.",
      "11.3. Всі електронні фінансові операції, здійснені через веб-сайт, будуть захищені технологією шифрування або в інший спосіб.",
      "11.4. Користувач визнає, що передача інформації (даних) через Інтернет є за своєю суттю небезпечною, і Виконавець не може гарантувати безпеку інформації (даних), що надсилаються через Інтернет.",
      "11.5. Користувач несе відповідальність за збереження паролів, який він використовує для доступу до веб-сайту, для здійснення фінансових операцій тощо.",
    ],
  },
  {
    heading: "12. Заключні положення",
    paragraphs: [
      "12.1. Право на зміни цієї Політики. Користувач погоджується з правом Виконавця на власний розсуд змінювати, додавати або видаляти умови цієї Політики в частині або в цілому в будь-який час в теперішньому або майбутньому. Такі зміни повинні відповідати положенням законодавства про захист персональних даних та Регламенту GDPR. Подальше використання послуг на веб-сайті після повідомлення про будь-які подібні зміни, додатки або видалення, вказують на те, що Користувач визнає такі зміни, додатки або видалення та погоджується їх вважати для себе обов'язковими для належного виконання. Виконавець може в будь-який час скасовувати замовлення, розміщене Користувачем з заблокованої IP-адреси або IP-адреси, що знаходиться у так званому «чорному» списку.",
      "12.2. Відшкодування збитків. У разі якщо Виконавець або Користувач внаслідок неналежного виконання умов цієї Політики заподіли шкоду один одному, такі збитки, моральна шкода, шкода діловій репутації відшкодовуються відповідно до закону.",
      "12.3. Географічні обмеження. Законом певної країни або через технічні обмеження, які діють у певній країні, в якій перебуває Користувач, можуть бути встановлені обмеження щодо доступу до послуг, які надаються на веб-сайті. Виконавець не несе відповідальності за такі обмеження.",
      "12.4. Використання файлів cookie. Після отримання згоди на обробку персональних даних для спрощення надання інформаційних та інших послуг Виконавець може використовувати файли cookie відповідно до положень чинного законодавства України, Регламенту GDPR, Директиви Європейського Парламенту і Ради (ЄС) 2018/1972 від 11 грудня 2018 року про запровадження Європейського кодексу електронних комунікацій.",
    ],
  },
];
  