import MakSectionTexts from "@/components/common/MakSectionTexts";

const ForWhatImages = () => {
  return (
    <div className="lg:pt-45 pt-10">
      <div className="flex lg:flex-row justify-between flex-col">
        <MakSectionTexts
          title="Для чого ці картини?"
          description="Це інструмент для роботи з емоціями, ресурсами, сенсами, внутрішнім світом. Вони допомагають дітям і дорослим через образи, символи та запитання:"
          list={[
            "розпізнавати й проживати свої емоції;",
            "знаходити внутрішні ресурси;",
            "працювати з тривогою, конфліктами та втратою;",
            "розвивати уяву та емоційний інтелект;",
            "відкривати нові смисли у звичних життєвих ситуаціях;",
            "Розуміти сенси та цілі і досягати їх;",
            "Дають поштовх та певний протокол дій і розуміння для ефективного психотерапевтичного процесу чи психологічного супроводу.",
          ]}
        />
        <h3 className="heading-4 lg:w-[40%] max-w-full">
          <span className="">
            Це арт-терапевтичний інструмент, який використовує символічні образи
            для пробудження емоцій, спогадів та внутрішніх асоціацій.
          </span>
          <br />
          <br />
          <span>
            Ці картини сприяють саморефлексії, розвитку усвідомленості та
            емоційного вираження. Метод поєднує принципи арт-терапії, Brief
            Solution-Focused Therapy (BSFT), поведінкових підходів і позитивної
            психології, допомагаючи клієнтові досліджувати внутрішній світ і
            знаходити власні ресурси у творчій, безпечній та невербальній формі.
            Опісля йти до цілі, формувати нову реальність.
          </span>
          <br />
          <br />
          <span>
            *Тренінги будуть бонусом як оновлення щомісяця для учасників.
          </span>
        </h3>
      </div>
    </div>
  );
};

export default ForWhatImages;
